# Questions

1. What if you want to read only two columns from your csv file and what is the fastest method? How to define each column type before actually reading the csv?

In [1]:
import pandas as pd

In [2]:
ufo=pd.read_csv('http://bit.ly/uforeports')

In [3]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [4]:
ufo=pd.read_csv('http://bit.ly/uforeports',usecols=[0,4])

In [5]:
ufo.columns

Index(['City', 'Time'], dtype='object')

In [6]:
ufo=pd.read_csv('http://bit.ly/uforeports',nrows=3)

In [7]:
ufo

          City  Colors Reported Shape Reported State             Time
0       Ithaca              NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro              NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke              NaN           OVAL    CO  2/15/1931 14:00

2. How do df and series work with regard to selecting individual entries and iteration (for X in userdata:)??

In [9]:
for c in ufo.City:
    print(c)

Ithaca
Willingboro
Holyoke

In [11]:
for index, row in ufo.iterrows():
    print(index,row.City,row.State)

0 Ithaca NY
1 Willingboro NJ
2 Holyoke CO

3. What's the best way to drop every non numeric column from a DataFrame?

In [13]:
drinks=pd.read_csv('http://bit.ly/drinksbycountry')

In [14]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [17]:
import numpy as np
drinks.select_dtypes(include=[np.number]).dtypes

beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
dtype: object

In [20]:
import numpy as np
drinks.select_dtypes(include=[np.number]).dtypes

beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
dtype: object

4. WHAT THE FORK ARE THESE DIFFERENT PARENTHESES!

In [22]:
drinks.describe(include=['object','float64'])

       country  total_litres_of_pure_alcohol continent
count      193                    193.000000       193
unique     193                           NaN         6
top       Laos                           NaN    Africa
freq         1                           NaN        53
mean       NaN                      4.717098       NaN
std        NaN                      3.773298       NaN
min        NaN                      0.000000       NaN
25%        NaN                      1.300000       NaN
50%        NaN                      4.200000       NaN
75%        NaN                      7.200000       NaN
max        NaN                     14.400000       NaN

In [23]:
drinks.describe(include=['object'])

       country continent
count      193       193
unique     193         6
top       Laos    Africa
freq         1        53